Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: A set of instructions for building packages. A recipe describes where you get source code, which patches to apply, how to configure the source, how to compile it and so on. Recipes also describe dependencies for libraries or for other recipes. Recipes represent the logical unit of execution, the software to build, the images to build, and use the ``.bb`` file extension.
it_it: Un insieme di istruzioni per la creazione di pacchetti. Una ricetta [recipe] descrive da dove ottenere il codice sorgente, quali patch applicare, come configurare il codice sorgente, come compilarlo e così via. Le ricette descrivono anche le dipendenze per le librerie o per altre ricette. Le ricette rappresentano l'unità logica di esecuzione, ovvero il software da compilare e le immagini da creare, e utilizzano l'estensione di file ``.bb``.

source: A single patch can be amended using ``git commit --amend``, and multiple patches can be easily reworked and reordered through an interactive Git rebase::
it_it: Una singola patch può essere modificata usando ``git commit --amend``, e più patch possono essere facilmente rielaborate e riordinate tramite un rebase interattivo di Git::

source: A software layer provides the Metadata for additional software packages used during the build. This layer does not include Metadata that is specific to the distribution or the machine, which are found in their respective layers.
it_it: Un layer software fornisce i metadati per i pacchetti software aggiuntivi utilizzati durante la compilazione. Questo layer non include i metadati specifici della distribuzione o della macchina, che si trovano nei rispettivi layer.

source: A toolchain only used by and within BitBake when building an image for a target architecture.
it_it: Una toolchain utilizzata esclusivamente da e all'interno di BitBake durante la creazione di un'immagine per un'architettura target.

source: A typical layout for the :term:`Source Directory` would be:
it_it: Una struttura tipica per la :term:`Source Directory` sarebbe:

source: A useful BitBake option to consider is the ``-k`` or ``--continue`` option. This option instructs BitBake to try and continue processing the job as long as possible even after encountering an error. When an error occurs, the target that failed and those that depend on it cannot be remade. However, when you use this option other dependencies can still be processed.
it_it: Un'opzione utile di BitBake da considerare è ``-k`` o ``--continue``. Questa opzione indica a BitBake di tentare di continuare l'elaborazione del job il più a lungo possibile anche dopo aver riscontrato un errore. Quando si verifica un errore, il target che ha fallito e quelli che dipendono da esso non possono essere ricreati. Tuttavia, quando si utilizza questa opzione, le altre dipendenze possono comunque essere elaborate.

source: A variant of :term:`buildtools`, just providing the required version of ``make`` to run the OpenEmbedded build system.
it_it: Una variante di :term:`buildtools`, che fornisce solo la versione necessaria di ``make`` per eseguire il sistema di build di OpenEmbedded.

source: A web interface to the Yocto Project's :term:`OpenEmbedded Build System`. The interface enables you to configure and run your builds. Information about builds is collected and stored in a database. For information on Toaster, see the :doc:`/toaster-manual/index`.
it_it: Un'interfaccia web per :term:`OpenEmbedded Build System` di Yocto Project. L'interfaccia consente di configurare ed eseguire le build. Le informazioni relative alle build vengono raccolte e memorizzate in un database. Per informazioni su Toaster, consultare il :doc:`/toaster-manual/index`.

source: A working example of a system, which includes a :term:`BSP<Board Support Package (BSP)>` as well as a :term:`build host<Build Host>` and other components, that can work on specific hardware.
it_it: Un esempio funzionante di un sistema, che include un :term:`BSP<Board Support Package (BSP)>`, un :term:`build host<Build Host>` e altri componenti, compatibile con hardware specifico.

source: ABI extensions are set in the machine include files. For example, the ``meta/conf/machine/include/arm/arch-arm.inc`` file sets the following extension::
it_it: Le estensioni ABI vengono impostate nei file di inclusione della macchina. Ad esempio, il file ``meta/conf/machine/include/arm/arch-arm.inc`` imposta la seguente estensione::

source: ABI/API breakage
it_it: Modifiche all'ABI/API

source: ARM architecture testing
it_it: Test dell'architettura ARM

source: Acceptance of AI Generated Code
it_it: Accettazione del Codice Generato dall'IA

source: Accepted upstream and included in the next release, or backported from newer upstream version, because we are at a fixed version. Include upstream version info (e.g. commit ID or next expected version).
it_it: Accettata dal progetto upstream e inclusa nella prossima release, oppure retroportata da una versione più recente del progetto upstream, poiché ci troviamo a una versione fissa. Includi le informazioni sulla versione del progetto upstream (ad esempio, ID del commit o prossima versione prevista).

source: Access the administration interface through a browser by entering the URL of your Toaster instance and adding "``/admin``" to the end of the URL. As an example, if you are running Toaster locally, use the following URL::
it_it: Accedere all'interfaccia di amministrazione tramite un browser inserendo l'URL dell'istanza di Toaster e aggiungendo "``/admin``" alla fine dell'URL. Ad esempio, se si esegue Toaster in locale, utilizzare il seguente URL::

source: Add ``sayhello`` to :term:`IMAGE_INSTALL` to integrate it into the root file system
it_it: Aggiungere ``sayhello`` a :term:`IMAGE_INSTALL` per integrarlo nel file system di root

source: Add an Apache configuration file for Toaster to your Apache web server's configuration directory. If you are using Ubuntu or Debian, put the file here::
it_it: Aggiungere un file di configurazione Apache per Toaster alla directory di configurazione del server web Apache. Se si usa Ubuntu o Debian, si inserisce il file qui::

source: Add and remove layers from your configuration.
it_it: Aggiungere e rimuovere layer dalla configurazione.

source: Add the database and user to the ``mysql`` server defined earlier::
it_it: Aggiungere il database e l'utente al server ``mysql`` definito in precedenza::

source: Adding ``do_deploy`` to ``SSTATETASKS`` adds some required sstate-related processing, which is implemented in the :ref:`ref-classes-sstate` class, to before and after the :ref:`ref-tasks-deploy` task.
it_it: Aggiungendo ``do_deploy`` a ``SSTATETASKS`` si aggiunge l'elaborazione necessaria relativa allo sstate, implementata nella classe :ref:`ref-classes-sstate`, prima e dopo il task :ref:`ref-tasks-deploy`.

source: Adding a Layer Using the ``bitbake-layers`` Script
it_it: Aggiungere un Layer Utilizzando lo Script ``bitbake-layers``

source: Adding a new tracepoint via ``perf probe`` results in an event with all the expected files and format in ``/sys/kernel/debug/tracing/events``, just the same as for static tracepoints (as discussed in more detail in the trace events subsystem section::
it_it: L'aggiunta di un nuovo tracepoint tramite ``perf probe`` genera un evento con tutti i file e il formato previsti in ``/sys/kernel/debug/tracing/events``, proprio come per i tracepoint statici (come discusso più dettagliatamente nella sezione relativa al sottosistema degli eventi di traccia)::

source: Additional Information About the Local Yocto Project Release
it_it: Ulteriori Informazioni sulla Release di Yocto Project Locale

source: Additional introductory resources.
it_it: Risorse introduttive aggiuntive.

source: Additionally, if Django is sufficient for your requirements, you can use it for your release system and migrate later to Apache as your requirements change.
it_it: Inoltre, se Django è sufficiente per le proprie esigenze, lo si può usare come sistema di rilascio e migrare ad Apache in seguito, quando le esigenze cambieranno.

source: Additionally, in order to generate the right type of debug info, we also need to set :term:`PACKAGE_DEBUG_SPLIT_STYLE` in the :ref:`structure-build-conf-local.conf` file::
it_it: Inoltre, per generare il tipo corretto di informazioni di debug, è necessario impostare anche :term:`PACKAGE_DEBUG_SPLIT_STYLE` nel file :ref:`structure-build-conf-local.conf`::

source: Additionally, in order to generate the type of debugging information that perf understands, we also need to set :term:`PACKAGE_DEBUG_SPLIT_STYLE` in a :term:`configuration file`::
it_it: Inoltre, per generare il tipo di informazioni di debug che perf comprende, dobbiamo anche impostare :term:`PACKAGE_DEBUG_SPLIT_STYLE` in un :term:`configuration file`::

source: Additionally, on distributions other than Debian 11 and Ubuntu 22.04 (otherwise see note below), install the following package:
it_it: Inoltre, su distribuzioni diverse da Debian 11 e Ubuntu 22.04 (altrimenti vedere la nota seguente), installare il seguente pacchetto:

source: Additionally, openSUSE Leap 15.6 requires a :term:`buildtools` tarball to be installed and set up, as this distribution provides a version of Python that is too old for :term:`BitBake`. Follow the :ref:`system-requirements-buildtools` section below for more information.
it_it: Inoltre, openSUSE Leap 15.6 richiede l'installazione e la configurazione di un tarball di :term:`buildtools`, poiché questa distribuzione fornisce una versione di Python troppo vecchia per :term:`BitBake`. Per ulteriori informazioni, consultare la sezione :ref:`system-requirements-buildtools` riportata di seguito.

source: Additionally, you can completely disable the content from the ``oe-core.xml`` and ``poky.xml`` files by defining the section shown below in the ``settings.xml`` file. For example, this option is particularly useful if your custom configuration defines fewer releases or layers than the default fixture files.
it_it: Inoltre, è possibile disabilitare completamente il contenuto dei file ``oe-core.xml`` e ``poky.xml`` definendo la sezione mostrata di seguito nel file ``settings.xml``. Ad esempio, questa opzione è particolarmente utile se la configurazione personalizzata definisce un numero inferiore di release o layer rispetto ai file di fixture di default.

source: Additionally, you must stipulate AI contributions conform to the Linux Foundation policy, specifically:
it_it: Inoltre, è necessario specificare che i contributi relativi all'IA siano conformi alle politiche della Linux Foundation, in particolare:

source: After clicking the "Add variable" button, the settings for :term:`PREFERRED_VERSION` are added to the bottom of the BitBake variables list. With these settings, the OpenEmbedded build system builds the desired version of the recipe rather than the default version:
it_it: Dopo aver cliccato sul pulsante "Add variable", le impostazioni per :term:`PREFERRED_VERSION` vengono aggiunte in fondo all'elenco delle variabili BitBake. Con queste impostazioni, il sistema di build OpenEmbedded compila la versione desiderata della ricetta anziché la versione di default:

source: After completing these steps, the following confirmation message appears::
it_it: Dopo aver completato questi passaggi, verrà visualizzato il seguente messaggio di conferma::

source: After doing that, we can start and stop the trace using the ``Run`` and ``Stop`` button on the lower right corner of the dialog (the same button will turn into the 'Stop' button after the trace has started):
it_it: Dopo aver fatto ciò, possiamo avviare e interrompere la traccia utilizzando i pulsanti ``Run`` e ``Stop`` nell'angolo in basso a destra della finestra di dialogo (lo stesso pulsante si trasformerà in 'Stop' dopo l'avvio della traccia):

source: After execution, the shared state directory should be populated with new files:
it_it: Dopo l'esecuzione, la directory di shared state dovrebbe essere popolata con nuovi file:

source: After generating updated patches (v2, v3, and so on) via ``git format-patch``, ideally developers will add a patch version changelog to each patch that describes what has changed between each revision of the patch. Add patch version changelogs after the ``---`` marker in the patch, indicating that this information is part of this patch, but is not suitable for inclusion in the commit message (i.e. the git history) itself. Providing a patch version changelog makes it easier for maintainers and reviewers to succinctly understand what changed in all versions of the patch, without having to consult alternate sources of information, such as searching through messages on a mailing list. For example::
it_it: Dopo aver generato patch aggiornate (v2, v3 e così via) tramite ``git format-patch``, idealmente gli sviluppatori dovrebbero aggiungere un changelog della versione della patch a ciascuna patch, che descriva le modifiche apportate tra le varie revisioni. Aggiungere il changelog della versione della patch dopo il marcatore ``---`` nella patch, indicando che queste informazioni fanno parte della patch stessa, ma non sono adatte per essere incluse nel messaggio di commit (ovvero nella cronologia di Git). Fornire un changelog della versione della patch facilita la comprensione sintetica delle modifiche apportate in tutte le versioni della patch da parte di manutentori e revisori, senza dover consultare fonti di informazione alternative, come ad esempio la ricerca tra i messaggi di una mailing list. Ad esempio::

source: After identifying the component to modify as described in the ":doc:`/contributor-guide/identify-component`" section, clone the corresponding Git repository. Here is an example for OpenEmbedded-Core::
it_it: Dopo aver identificato il componente da modificare come descritto nella sezione ":doc:`/contributor-guide/identify-component`", clonare il repository Git corrispondente. Ecco un esempio per OpenEmbedded-Core::

source: After identifying the right mailing list to use, you will have to subscribe to it if you haven't done it yet.
it_it: Dopo aver individuato la mailing list più adatta, si dovrà iscriversi se non già fatto.

source: After placing the recipes in a custom layer we can run ``bitbake sayhello`` to build the recipe.
it_it: Dopo aver inserito le ricette in un layer personalizzato, possiamo eseguire ``bitbake sayhello`` per compilare la ricetta.

source: After running these commands, you can run the ``checksettings`` command.
it_it: Dopo aver eseguito questi comandi, è possibile eseguire il comando ``checksettings``.

source: After source code is configured, compiled, and staged, the build system analyzes the results and splits the output into packages:
it_it: Dopo che il codice sorgente è stato configurato, compilato e predisposto, il sistema di build analizza i risultati e suddivide l'output in pacchetti:

source: After source code is patched, BitBake executes tasks that configure and compile the source code. Once compilation occurs, the files are copied to a holding area (staged) in preparation for packaging:
it_it: Dopo l'applicazione delle patch al codice sorgente, BitBake esegue dei task di configurazione e compilazione. Una volta completata la compilazione, i file vengono copiati in un'area temporanea (staging) in preparazione per il packaging:

source: After the binaries are created, the build system generates a binary package feed that is used to create the final root file image.
it_it: Dopo la creazione dei file binari, il sistema di build genera un feed di pacchetti binari che viene utilizzato per creare l'immagine finale del file system root.

source: After the command is run, the current directory contains numbered ``.patch`` files for the commits in your branch. If you have a cover letter, it will be in the ``0000-cover-letter.patch``.
it_it: Dopo l'esecuzione del comando, la directory corrente conterrà file ``.patch`` numerati per i commit del branch. Se c'è una lettera di presentazione, la si troverà nel file ``0000-cover-letter.patch``.

source: After the root filesystem is built, processing begins on the image through the :ref:`ref-tasks-image` task. The build system runs any pre-processing commands as defined by the :term:`IMAGE_PREPROCESS_COMMAND` variable. This variable specifies a list of functions to call before the build system creates the final image output files.
it_it: Dopo la creazione del filesystem root, l'elaborazione dell'immagine inizia tramite il task :ref:`ref-tasks-image`. Il sistema di compilazione esegue tutti i comandi di pre-elaborazione definiti dalla variabile :term:`IMAGE_PREPROCESS_COMMAND`. Questa variabile specifica un elenco di funzioni da chiamare prima che il sistema di compilazione crei i file di output finali dell'immagine.

source: After the third milestone release (M3), the Yocto Project enters **Feature Freeze**. This means that the maintainers of :term:`OpenEmbedded-Core (OE-Core)`, :term:`BitBake` and other core repositories stop accepting significant changes on the "master" branch. Changes that may be accepted are minor upgrades to core components and security/bug fixes.
it_it: Dopo la terza release (M3), Yocto Project entra in **Feature Freeze**. Ciò significa che i manutentori di :term:`OpenEmbedded-Core (OE-Core)`, :term:`BitBake` e altri repository centrali smettono di accettare modifiche significative sul branch "master". Le modifiche che possono essere accettate sono piccoli aggiornamenti ai componenti principali e correzioni di bug/sicurezza.

source: After you have sourced the setup script, the tools are added to ``PATH`` and any other environment variables required to run the tools are initialized. The results are working versions of Git, tar, Python and ``chrpath``. And in the case of the :term:`buildtools-extended` tarball, additional working versions of tools including ``gcc``, ``make`` and the other tools included in ``packagegroup-core-buildessential``.
it_it: Dopo aver eseguito lo script di configurazione, gli strumenti vengono aggiunti a ``PATH`` e vengono inizializzate tutte le altre variabili d'ambiente necessarie per il loro funzionamento. Il risultato saranno versioni funzionanti di Git, tar, Python e ``chrpath``. E nel caso del tarball :term:`buildtools-extended`, sono presenti versioni funzionanti aggiuntive di strumenti tra cui ``gcc``, ``make`` e gli altri strumenti inclusi in ``packagegroup-core-buildessential``.

source: Again, before we expanded we saw that the function was labeled with a hex value instead of a symbol as with most of the kernel entries. Expanding the BusyBox entry doesn't make it any better.
it_it: Anche in questo caso, prima di espandere la voce, abbiamo notato che la funzione era etichettata con un valore esadecimale anziché con un simbolo, come avviene per la maggior parte delle voci del kernel. Espandere la voce BusyBox non migliora la situazione.

source: All AI Generated Code must be labeled as such in the commit message, prior to your ``Signed-off-by`` line. It is also strongly recommended, that any patches or code within the commit also have a comment or other indication that this code was AI generated.
it_it: Tutto il codice generato dall'IA deve essere etichettato come tale nel messaggio di commit, prima della riga ``Signed-off-by``. Si raccomanda inoltre vivamente che qualsiasi patch o codice all'interno del commit contenga un commento o un'altra indicazione che specifichi che tale codice è stato generato dall'IA.

source: All changes must have already been accepted into the current master release and any other release still within its stable support window.
it_it: Tutte le modifiche devono essere già state accettate nella release master corrente e in qualsiasi altra release ancora all'interno del suo periodo di supporto stabile.

source: All of the existing guidelines in this document are expected to be followed, including in the :doc:`/contributor-guide/recipe-style-guide`, and contributing the changes with additional requirements to the items in section :ref:`contributor-guide/submit-changes:Implement and commit changes`.
it_it: È necessario seguire tutte le linee guida presenti in questo documento, incluse quelle contenute nella :doc:`/contributor-guide/recipe-style-guide`, e contribuire con modifiche e requisiti aggiuntivi agli elementi nella sezione :ref:`contributor-guide/submit-changes:Implement and commit changes`.

source: All the output files for an SDK are written to the ``deploy/sdk`` folder inside the :term:`Build Directory` as shown in the previous figure. Depending on the type of SDK, there are several variables to configure these files. The variables associated with an extensible SDK are:
it_it: Tutti i file di output di un SDK vengono scritti nella cartella ``deploy/sdk`` all'interno della :term:`Build Directory`, come mostrato nella figura precedente. A seconda del tipo di SDK, esistono diverse variabili per configurare questi file. Le variabili associate a un SDK estensibile sono:

source: Allowing only local command-line builds to be captured into the Toaster database.
it_it: Consentire che solo le build locali da riga di comando vengano acquisite nel database di Toaster.

source: AlmaLinux Packages
it_it: Pacchetti AlmaLinux

source: Also notice that there are various annotations on the left hand side of the display. For example if the total time it took for a given function to execute is above a certain threshold, an exclamation point or plus sign appears on the left hand side. Please see the ftrace documentation for details on all these fields.
it_it: Si notino anche le varie annotazioni presenti sul lato sinistro della visualizzazione. Ad esempio, se il tempo totale impiegato per l'esecuzione di una determinata funzione supera una certa soglia, sul lato sinistro compare un punto esclamativo o un segno più. Per maggiori dettagli su tutti questi campi, consultate la documentazione di ftrace.

source: Also, note that ``perf stat`` isn't restricted to a fixed set of counters --- basically any event listed in the output of ``perf list`` can be tallied by ``perf stat``. For example, suppose we wanted to see a summary of all the events related to kernel memory allocation/freeing along with cache hits and misses::
it_it: Inoltre, si noti che ``perf stat`` non è limitato a un set fisso di contatori: praticamente qualsiasi evento elencato nell'output di ``perf list`` può essere conteggiato da ``perf stat``. Ad esempio, supponiamo di voler visualizzare un riepilogo di tutti gli eventi relativi all'allocazione/liberazione della memoria del kernel, insieme ai cache hit e ai cache miss::

source: Alternatively if your host development system has a broken ``make`` version such that you only need a known good version of ``make``, you can use the ``--make-only`` option::
it_it: In alternativa, se il sistema host di sviluppo ha una versione di ``make`` non funzionante e si necessita solo di una versione funzionante, è possibile utilizzare l'opzione ``--make-only``::

source: Alternatively, you can add ``tools-profile`` to the :term:`EXTRA_IMAGE_FEATURES` line in your :ref:`structure-build-conf-local.conf` file::
it_it: In alternativa, è possibile aggiungere ``tools-profile`` alla riga :term:`EXTRA_IMAGE_FEATURES` nel file :ref:`structure-build-conf-local.conf`::

source: Alternatively, a custom package can be added by adding it to the :term:`PACKAGES` variable using the prepend operator (``=+``)::
it_it: In alternativa, un pacchetto personalizzato può essere aggiunto inserendolo nella variabile :term:`PACKAGES` utilizzando l'operatore di prefisso (``=+``)::
